# FabricParamCutOverallWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamCutOverallWidth Property
ParameterTypeId Class See Also
---
"Cut Overall Width": Provides a real sheet Width after definition
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamCutOverallWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamCutOverallWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamCutOverallWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace